{
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": "nvidia/audio-flamingo-3-hf",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 32,
  "lora_dropout": 0.1,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 4,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "o_proj",
    "linear_1",
    "down_proj",
    "gate_proj",
    "q_proj",
    "k_proj",
    "out_proj",
    "fc1",
    "fc2",
    "linear_2",
    "v_proj",
    "up_proj"
  ],
  "task_type": "CAUSAL_LM",
  "use_dora": false,
  "use_rslora": true
}